Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The options with the `quarkus.kafka-streams` prefix can be changed dynamically at application startup, e.g. via environment variables or system properties. `bootstrap-servers` and `application-server` are mapped to the Kafka Streams properties `bootstrap.servers` and `application.server`, respectively. `topics` is specific to Quarkus: the application will wait for all the given topics to exist before launching the Kafka Streams engine. This is to done to gracefully await the creation of topics that don't yet exist at application startup time.
ja_jp: `quarkus.kafka-streams` `bootstrap-servers` と は、それぞれ Kafka Streams プロパティー と にマップされます。 `application-server` `bootstrap.servers` `application.server` `topics` は Quarkus に固有のもので、アプリケーションは Kafka Streams エンジンを起動する前に、指定したすべてのトピックが存在するのを待ちます。これは、アプリケーションの起動時にまだ存在しないトピックの作成をグレースフルに待つために行われます。

source: The order in which filters are executed is defined by https://quarkus.io/specs/jaxrs/2.1/index.html#priorities[Priorities]. Note that `CustomLoggingFilter` is using a default value, so the user-level priority and the `StorkClientRequestFilter` uses the security authentication filter priority. This means that `StorkClientRequestFilter` will be executed before our `CustomLoggingFilter`. Use `@Priority` annotation to change this behaviour.
ja_jp: フィルタの実行順序は、 https://quarkus.io/specs/jaxrs/2.1/index.html#priorities[プロパティ] で定義されます。 `CustomLoggingFilter` はデフォルト値を使用しているので、ユーザーレベルの優先順位、 `StorkClientRequestFilter` はセキュリティ認証フィルタの優先順位を使用していることに注意してください。これは、 `StorkClientRequestFilter` が `CustomLoggingFilter` の前に実行されることを意味します。この挙動を変更するには、 `@Priority` アノテーションを使用します。

source: The original French article mentioned hitting such a limit at a particular scale. To be fair, that scale was already quite large, but it's still not ideal to run into an arbitrary limit just because one class happens to push you over the edge.
ja_jp: 元のフランス語の記事では、特定の規模でこのような制限に達したことが述べられていました。公平に言えば、その規模はすでにかなり大きいものでしたが、あるクラスがたまたま限界を超えたというだけで、任意の制限に遭遇するのは理想的ではありません。

source: The original jar will still be present in the `target` directory but it will be renamed to contain the `.original` suffix.
ja_jp: 元の jar は `target` ディレクトリーに残っていますが、 `.original` の接尾辞を含むように名前が変更されます。

source: The original jar will still be present in the `target` directory, but it will be renamed to contain the `.original` suffix.
ja_jp: 元の jar は `target` ディレクトリーに残っていますが、 `.original` のサフィックスを含むように名前が変更されます。

source: The original test could be rewritten like:
ja_jp: 元のテストを次のように書き直すことができます。

source: The origins of the configuration entries can be found in text files inside the `target/native-image-agent-base-config` folder. For example:
ja_jp: 設定エントリーの取得元は、 `target/native-image-agent-base-config` フォルダー内のテキストファイルにあります。 たとえば:

source: The other approach relies on protocol capabilities and enables efficient transfer and encoding. If we use the binary mode with Kafka, we will store the `data` attribute value in the Kafka record's value and pass the other attributes using the record's headers. Consequently, business data can be encoded using binary protocols such as Avro, leading to higher efficiency.
ja_jp: もう一つのアプローチはプロトコルの能力に依存しており、効率的な転送とエンコードを可能にします。Kafkaでバイナリーモードを使用する場合、Kafkaレコードの値に `data` 属性の値を格納し、レコードのヘッダを使用して他の属性を渡すことになります。その結果、Avroなどのバイナリープロトコルを使ってビジネスデータをエンコードすることができ、効率化につながります。

source: The other attributes are optional. `datacontenttype` defines the content-type of the `data` attribute. `subject` allows passing extra details about the event, such as an additional hint about the context or the type of event. `time` is a timestamp, generally indicating the creation time. There is another optional attribute not used in my example. The `dataschema` attribute lets you pass the schema of the event data.
ja_jp: `datacontenttype` は `data` 属性の content-type を定義します。 `subject` では、コンテキストやイベントのタイプに関する追加のヒントなど、イベントに関する追加の詳細を渡すことができます。 `time` はタイムスタンプで、一般的には作成時刻を示します。私の例では使用していない別のオプションの属性があります。 `dataschema` 属性は、イベントデータのスキーマを渡すことができます。

source: The other build step will only be executed in dev mode.
ja_jp: もう一つのビルドステップは、dev モードでのみ実行されます。

source: The other fields, such as `subject`, `teacher` and `studentGroup`, are filled in. These fields are problem properties.
ja_jp: `subject`、 `Teacher`、 `studentGroup` などの他のフィールドが入力されます。これらのフィールドは、問題のプロパティーです。

source: The other form is using the `for` name and can specify the alias used to reference the iteration element:
ja_jp: もう一つの形態は、 `for` 名を使用し、反復要素の参照に使用するエイリアスを指定することができます:

source: The other form is using the name `for` and specifies the alias used to reference the iteration element:
ja_jp: もう一つの形式は、`for` という名前を使い、反復要素を参照するために使われるエイリアスを指定します。

source: The other properties are related to Stork. `stork.my-service.service-discovery` indicates which type of service discovery we will be using to locate the `my-service` service. In our case, it's `consul`. `quarkus.stork.my-service.service-discovery.consul-host` and `quarkus.stork.my-service.service-discovery.consul-port` configures the access to Consul. Finally, `quarkus.stork.my-service.load-balancer.type` configures the service selection. In our case, we use a `round-robin`.
ja_jp: `stork.my-service.service-discovery` は、 `my-service` サービスの検索に使用するサービスディスカバリーのタイプを示しています。 `consul` `stork.my-service.service-discovery.consul-host` と `stork.my-service.service-discovery.consul-port` は Consul へのアクセスを設定します。最後に、 `stork.my-service.load-balancer` は、サービスのセレクションを設定します。今回のケースでは、 `round-robin` を使用します。

source: The other properties are related to Stork. `stork.my-service.service-discovery` indicates which type of service discovery we will be using to locate the `my-service` service. In our case, it's `consul`. `stork.my-service.service-discovery.consul-host` and `stork.my-service.service-discovery.consul-port` configures the access to Consul. Finally, `stork.my-service.load-balancer` configures the service selection. In our case, we use a `round-robin`.
ja_jp: 他のプロパティはStorkに関連しています。 `stork.my-service.service-discovery` は、 `my-service` サービスの場所を特定するために使用するサービス発見のタイプを示します。 今回の場合、 `consul` です。v `stork.my-service.service-discovery.consul-host` と `stork.my-service.service-discovery.consul-port` は、Consulへのアクセスを設定します。 最後に、 `stork.my-service.load-balancer` はサービスの選択を設定します。 今回の場合、 `round-robin` を使用します。

source: The other trick we applied was to cancel the current build on _master_ if a new one got triggered; that way we would not have multiple native builds running at the same time. In theory it could be frustrating to get a build killed because another commit was done. In practice this was not an issue because the rate of PRs getting merged on _master_ stayed low.
ja_jp: もう一つの工夫は、新しいビルドが開始されたときに、 _マスター_の現在のビルドをキャンセルすることでした。理論的には、別のコミットが行われたためにビルドがキャンセルされるのはフラストレーションがたまるかもしれません。実際には、PRが _master_にマージされる割合は低いままだったので、この問題はありませんでした。

source: The out-of-the-box performance of Quarkus on JVM exceeded their expectations quite easily:
ja_jp: JVM上のQuarkusの初期設定でのパフォーマンスは、期待をいとも簡単に超えるものでした。

source: The output directory of the first execution of the plugin is set to `oracle-quarkus-app` instead of `quarkus-app` to have a dedicated directory.
ja_jp: プラグインの最初の実行の出力ディレクトリーは、専用ディレクトリーを持つために、 `quarkus-app` ではなく `oracle-quarkus-app` に設定されます。

source: The output directory of the second execution of the plugin is set to `postgresql-quarkus-app` instead of `quarkus-app` to have a dedicated directory.
ja_jp: プラグインの 2 回目の実行の出力ディレクトリーは、専用ディレクトリーを持つために、 `quarkus-app` ではなく `postgresql-quarkus-app` に設定されます。

source: The output is `Hello world!`
ja_jp: 出力は `Hello world!` です

source: The output is `olleh`
ja_jp: 出力は `olleh` です

source: The output of a `ObserverConfigurator` is recorded as bytecode. Therefore, there are some limitations in how a synthetic observer is invoked at runtime. Currently, you must generate the bytecode of the method body directly.
ja_jp: `ObserverConfigurator` の出力はバイトコードとして記録されます。したがって、実行時に合成オブザーバーを呼び出す方法にはいくつかの制限があります。現時点では、メソッド本体のバイトコードを直接生成する必要があります。

source: The output of a bean configurator is recorded as bytecode. Therefore, there are some limitations in how a synthetic bean instance is created at runtime. You can:
ja_jp: Bean Configurator の出力は、バイトコードとして記録されます。したがって、実行時に合成 Bean インスタンスを作成する方法にはいくつかの制限があります。以下が可能です。

source: The output of an `ObserverConfigurator` is recorded as bytecode. Therefore, there are some limitations in how a synthetic observer is invoked at runtime. Currently, you must generate the bytecode of the method body directly.
ja_jp: `ObserverConfigurator` の出力はバイトコードとして記録されます。 したがって、実行時に合成オブザーバーを呼び出す方法にはいくつかの制限があります。 現時点では、メソッド本体のバイトコードを直接生成する必要があります。

source: The output of the `list` command may be filtered by `type` using `-t` or by name using `-s` flag and a search pattern.
ja_jp: `list` コマンドの出力は、 `-t` を使用して `type` でフィルタリングすることも、 `-s` フラグと検索パターンを使用して名前でフィルタリングすることもできます。

source: The output telemetry data is handled by the OpenTelemetry SDK and sent by the `quarkus-opentelemetry` extension exporter using the OTLP protocol.
ja_jp: 出力テレメトリーデータは OpenTelemetry SDK によって処理され、OTLP プロトコルを使用して `quarkus-opentelemetry` エクステンションエクスポーターによって送信されます。

source: The output will show your project being created:
ja_jp: 出力には、プロジェクトが作成されていることが表示されます。

source: The overall architecture looks like so:
ja_jp: 全体のアーキテクチャはこのような感じです:

source: The overall architecture should be a multi-service microservices architecture.
ja_jp: 全体のアーキテクチャは、マルチサービス・マイクロサービス・アーキテクチャであること。

source: The package will be automatically replaced in all the source files (.java, .kt, .scala). The package directory will also be automatically adjusted. If for some reason, another type of file needs the user package name then you should use a <<qute-templates>> for it and the `{project.package-name}` data placeholder (https://github.com/quarkusio/quarkus/blob/main/devtools/project-core-extension-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts/grpc-codestart/base/src/main/proto/hello.tpl.qute.proto#L4[find an example in the grpc proto file, window="_blank"]).
ja_jp: パッケージは、すべてのソースファイル (.java、.kt、.scala) で自動的に置換されます。パッケージのディレクトリーも自動的に調整されます。もし、何らかの理由で、他のタイプのファイルがユーザーパッケージ名を必要とする場合、そのファイルおよび `{project.package-name}` データプレースホルダー (https://github.com/quarkusio/quarkus/blob/main/devtools/project-core-extension-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts/grpc-codestart/base/src/main/proto/hello.tpl.qute.proto#L4[grpc proto ファイルにおけるサンプル, window="_blank"]). に <<qute-templates>> を使用すべきです。

source: The package will be automatically replaced in all the source files (.java, .kt, .scala). The package directory will also be automatically adjusted. If for some reason, another type of file needs the user package name then you should use a xref:qute-templates[Templates (Qute)] for it and the `{project.package-name}` data placeholder (https://github.com/quarkusio/quarkus/blob/main/devtools/project-core-extension-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts/grpc-codestart/base/src/main/proto/hello.tpl.qute.proto#L4[find an example in the grpc proto file, window="_blank"]).
ja_jp: すべてのソースファイル（.java、.kt、.scala）において、パッケージが自動的に置換されます。また、パッケージのディレクトリも自動的に調整されます。何らかの理由で、他の種類のファイルがユーザーパッケージ名を必要とする場合、そのファイルには xref:qute-templates[テンプレート（Qute] ）を使用し、 `{project.package-name}` データのプレースホルダを使用する必要があります（ link:https://github.com/quarkusio/quarkus/blob/main/devtools/project-core-extension-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts/grpc-codestart/base/src/main/proto/hello.tpl.qute.proto#L4[grpc proto ファイルに例] があります）。

source: The parameter of the `process` method is the incoming message payload, whereas the return value will be used as the outgoing message payload. Previously mentioned signatures for parameter and return types are also supported, such as `Message<T>`, `Record<K, V>`, etc.
ja_jp: `process` メソッドのパラメーターは着信メッセージのペイロードですが、戻り値は送信メッセージのペイロードとして使用されます。 `Message<T>`、 `Record<K, V>` など、前述のパラメーターとリターンタイプのシグネチャーもサポートされています。

source: The parameters passed to the application are described in the datasource guide. There are other ways to configure the application - please check the xref:config-reference.adoc#configuration-sources[configuration guide] to have an overview of the possibilities (such as env variable, .env files and so on).
ja_jp: アプリケーションに渡されるパラメータは、データソースガイドに記載されています。アプリケーションを設定する方法は他にもあります。 xref:config-reference.adoc#configuration-sources[設定ガイド]を参照して、利用可能なオプションの概要を確認してください（env変数、.envファイルなど）。

source: The parameters passed to the application are described in the datasource guide. There are other ways to configure the application - please check the xref:config-reference.adoc#configuration_sources[configuration guide] to have an overview of the possibilities (such as env variable, .env files and so on).
ja_jp: アプリケーションに渡されるパラメータは、データソースガイドに記載されています。アプリケーションを設定する方法は他にもあります。 link:config-reference.html#configuration_sources[設定ガイド]を参照して、可能性の概要を確認してください（env変数、.envファイルなど）。

source: The parent category is examined if no level configuration exists for a given logger category.
ja_jp: 指定されたロガー カテゴリにレベル設定が存在しない場合、親カテゴリが調べられます。

source: The parent module - nothing to see here
ja_jp: 親モジュール - 特に注意すべきことはありません

source: The parent of all logging categories is called the "root category." As the ultimate parent, this category might contain a configuration that applies globally to all other categories. This includes the globally configured handlers and formatters.
ja_jp: すべてのロギングカテゴリの親は、"ルートカテゴリ "と呼ばれます。最終的な親として、このカテゴリは他のすべてのカテゴリにグローバルに適用される設定を含むことができます。 これには、グローバルに設定されたハンドラとフォーマッタが含まれます。

source: The parent pom.xml
ja_jp: 親 pom.xml

source: The parent profile is `common`
ja_jp: 親プロファイルは `common` です

source: The partial contents of a file
ja_jp: ファイルの部分的な内容

source: The partial contents of the file specified by the given path
ja_jp: 指定されたパスで指定されたファイルの部分的な内容

source: The password for opening the truststore is taken from the `javax.net.ssl.trustStorePassword` system property. If this property is not set, the default password `changeit` is used.
ja_jp: トラストストアを開くためのパスワードは、`javax.net.ssl.trustStorePassword` システムプロパティーから取得されます。 このプロパティーが設定されていない場合は、デフォルトのパスワード `changeit` が使用されます。

source: The password mapper is configured with the position of the password field in the `SELECT` fields. The hash is stored in the Modular Crypt Format (MCF) because the salt and iteration count indexes are set to `-1` by default. You can override them in order to decompose each element into three separate columns.
ja_jp: パスワードマッパーは、 `SELECT` フィールドのパスワードフィールドの位置で設定されます。ハッシュはモジュラークリプトフォーマット(MCF)に格納されます。これはソルトと反復回数のインデックスがデフォルトで `-1` に設定されているからです。各要素を3つの別々のカラムに分解するために、それらをオーバーライドすることができます。

source: The password of the JKS trust store Type: _string_
ja_jp: JKS トラストストアのパスワード Type: _string_

source: The password that is used to secure communication between the remote side and the local side.
ja_jp: リモート側とローカル側の通信を安全に保つためのパスワードです。

source: The password to open the truststore is obtained from the `javax.net.ssl.trustStorePassword` system property. If this property is not set, the default password `changeit` is used.
ja_jp: トラストストアを開くためのパスワードは、`javax.net.ssl.trustStorePassword` システムプロパティーから取得されます。このプロパティーが設定されていない場合は、デフォルトのパスワード `changeit` が使用されます。

source: The password used to authenticate to the broker Type: _string_
ja_jp: ブローカーへの認証に使用されるパスワード Type: _string_

source: The path `/api/public-product/detail` is more specific, therefore accessible by anyone.
ja_jp: パス `/api/public-product/detail` はより詳細であるため、どのユーザーもアクセスできます。

source: The path defines a parameter `name` which can be injected inside the method parameters using the annotation `@Param`.
ja_jp: パスはパラメータ `name` を定義します。パラメータ `name` は `@Param` アノテーションを使用してメソッドパラメータ内に注入することができます 。

source: The path of a WebSocket endpoint can contain path parameters. The syntax is the same as for JAX-RS resources: `{parameterName}`.
ja_jp: WebSocket エンドポイントのパスには、パスパラメーターを含めることができます。 構文は JAX-RS リソースの場合と同じです: `{parameterName}`

source: The path of a type-safe template (`@CheckedTemplate` method or record) consists of a _base path_ and a _defaulted name_. The _base path_ is supplied by the `@CheckedTemplate#basePath()`. By default, the simple name of the enclosing class for a nested static class or an empty string for a top level class is used. The _defaulted name_ is derived by the strategy specified in `@CheckedTemplate#defaultName()`. By default, the name of the `@CheckedTemplate` method/record is used as is.
ja_jp: `@CheckedTemplate` メソッドまたはレコードのタイプセーフなテンプレートパスには、 _ベースパス_ と _デフォルトの名前_が使用されます。 _ベースパス_ は `@CheckedTemplate#basePath()` で指定されます。 デフォルトでは，ネストした静的クラスの場合は宣言クラスのsimple name，トップレベルクラスの場合は空文字列が使用されます。 _デフォルトの名前_ は， `@CheckedTemplate#defaultName()` で指定された戦略によって導出されます。 デフォルトでは、 `@CheckedTemplate` のメソッドの名前がそのまま使われます。

source: The path to a JKS trust store Type: _string_
ja_jp: JKS トラストストアへのパス Type: _string_

source: The path to the `application.properties` and `application.yaml` files are relative to the script file.
ja_jp: `application.properties` ファイルと `application.yaml` ファイルへのパスは、スクリプトファイルからの相対パスです。

source: The path to the ´KeyStore` with encryption key.
ja_jp: 暗号化キーが格納されている´KeyStore`へのパス。

source: The path to the ´KeyStore` with properties secrets
ja_jp: secretsプロパティを持つ´KeyStore`へのパス

source: The paths to the JAR and archive must match exactly between build and runtime
ja_jp: JAR とアーカイブへのパスは、ビルド時と実行時で完全に一致している必要があります

source: The paths to the Quarkus jar file and the AppCDS archive need to be exactly the same as those Quarkus used to build the archive
ja_jp: QuarkusのjarファイルとAppCDSアーカイブのパスは、Quarkusがアーカイブをビルドする際に使用したパスと完全に同じである必要があります。

source: The pattern of authenticating with a given provider, where the endpoint uses either an ID token or UserInfo (especially if an OAuth2-only provider such as `GitHub` is used) to get some information about the currently authenticated user and using an access token to access some downstream services (provider or application specific ones) on behalf of this user can be universally applied, irrespectively of which provider is used to secure the application.
ja_jp: エンドポイントは、IDトークンかUserInfo（特に `GitHub` のようなOAuth2のみのプロバイダが使用されている場合）を使用して、現在認証されているユーザーに関する情報を取得し、アクセストークンを使用して、このユーザーに代わって下流のサービス（プロバイダまたはアプリケーション固有のもの）にアクセスするという、所定のプロバイダで認証を行うパターンは、アプリケーションの安全性を確保するためにどのプロバイダが使用されているかに関係なく、普遍的に適用できます。

source: The patterns are valid Java regexps. Here we include all the XML files and JSON files into the native executable.
ja_jp: このパターンは有効な Java 正規表現です。ここでは、すべての XML ファイルと JSONファイル をネイティブ実行可能ファイルに含めています。

source: The payload is converted to JSON (using a Json Mapper) then serialized with `content_type` set to `application/json`
ja_jp: ペイロードは (Json Mapper を使用して) JSON に変換され、その後 `content_type` が `application/json json` に設定されてシリアライズされます。

source: The payload is converted to JSON (using a Json Mapper). The result is wrapped into AMQP Data using a **binary** content. The `content-type` is set to `application/json`
ja_jp: ペイロードは (Json Mapper を使用して) JSON に変換されます。結果は、**バイナリー**コンテンツを使用して AMQP データにラップされます。 `content-type` は `application/json` に設定されます

source: The payload, also called "claims", which includes the token's claims or data.
ja_jp: ペイロードはクレームとも呼ばれ、トークンのクレームまたはデータが含まれます。

source: The performance penalty of preserving the frame pointer is due to using the extra register for stack walking, particularly in `x86_64` compared to `aarch64` where there are fewer registers available. Using this extra register reduces the number of registers that are available for other work, which can lead to performance penalties.
ja_jp: フレームポインターを保持することによる性能上のペナルティーは、スタックウォーキングのために余分なレジスタを使用することによるもので、特に `aarch64` と比較して `x86_64` では使用できるレジスターの数が少なくなります。この余分なレジスターを使用すると、他の作業に使用できるレジスターの数が減るため、性能上のペナルティーが発生します。

source: The performance penalty of preserving the frame pointer is due to using the extra register for stack walking, particularly in `x86_64` compared to `aarch64` where there are less registers available. Using this extra register reduces the number of registers that are available for other work, which can lead to performance penalties.
ja_jp: フレームポインタを保持することによる性能上のペナルティは、スタックウォーキングのために余分なレジスタを使用することによるもので、特に `aarch64` と比較して `x86_64` では使用できるレジスタの数が少なくなります。この余分なレジスタを使用すると、他の作業に使用できるレジスタの数が減るため、性能上のペナルティが発生します。

source: The period (in milliseconds) between two attempts to retrieve the credits granted by the broker. This time is used when the sender run out of credits. Type: _int_
ja_jp: ブローカーによって付与されたクレジットを取得する 2 つの試行の間の期間 (ミリ秒単位)。この時間は、送信者がクレジットを使い果たしたときに使用されます。 タイプ: _int_

source: The permission `media-library` that was created can perform `read`, `write`, and `list` actions. Because `MediaLibrary` is the `TvLibrary` class parent, a user with the `admin` role is also permitted to modify `TvLibrary`.
ja_jp: 作成された権限 `media-library` は、 `read`、 `write`、および `list` アクションを実行できます。 `MediaLibrary` は `TvLibrary` クラスの親であるため、 `admin` ロールを持つユーザーも `TvLibrary` を変更することが許可されます。

source: The permission checker above requires the `SecurityIdentity` instance to authorize the `renameProject` endpoint. Instead of declaring the `rename-project` permission checker directly on the resource, you can declare it on any CDI bean like in this example:
ja_jp: 上記の権限チェッカーでは、 `renameProject` エンドポイントを承認するために `SecurityIdentity` インスタンスが必要です。 `rename-project` 権限チェッカーをリソース上で直接宣言する代わりに、次の例のように任意の CDI Bean 上で宣言できます。

source: The permission checker method `canDeleteAllDirectories` grants access to the `deleteDirectory` because the `delete:all` values are equal.
ja_jp: 権限チェッカーメソッド `canDeleteAllDirectories` は、 `delete:all` 値が等しいため、 `deleteDirectory` へのアクセスを許可します。

source: The permission checker method must return either `boolean` or `Uni<Boolean>`. Private checker methods are not supported.
ja_jp: 権限チェッカーメソッドは、 `boolean` または `Uni<Boolean>` を返す必要があります。プライベートチェッカーメソッドはサポートされていません。

source: The permission required to access the `ProjectResource#renameProject` is the `rename-project` permission.
ja_jp: `ProjectResource#renameProject` にアクセスするために必要な権限は、 `rename-project` 権限です。

source: The platform descriptor will normally be generated using a Maven plugin, e.g.
ja_jp: プラットフォームディスクリプタは通常、Mavenプラグインを使用して生成されます。

source: The platform model and supporting tools available in Quarkus 2.1.0.Final make it easy to discover and work with the Quarkus extension ecosystem.
ja_jp: Quarkus 2.1.0.Finalで利用可能なプラットフォームモデルとサポートツールにより、Quarkusのエクステンションエコシステムを簡単に発見し、利用することができます。

source: The plugin also exposes a `quarkusDev` configuration. Using this configuration to declare a dependency will restrict the usage of that dependency to development mode. The `quarkusDev` configuration can be used as following:
ja_jp: このプラグインは `quarkusDev` の設定も公開しています。この設定を使って依存関係を宣言すると、その依存関係の使用が開発モードに制限されます。 `quarkusDev` の設定は以下のように使用できます。

source: The polling timeout in milliseconds. When polling records, the poll will wait at most that duration before returning records. Default is 1000ms Type: _int_
ja_jp: ミリ秒単位のポーリングタイムアウト。レコードをポーリングする場合、ポーリングは最大でその期間待機してからレコードを返します。デフォルトは 1000ms です Type: _int_

source: The pooling case
ja_jp: プーリングの場合

source: The port is `9093`.
ja_jp: ポートは `9093` です。

source: The port the proxy is listening can be found in startup logs. An example entry is:
ja_jp: プロキシーがリッスンしているポートは、起動ログで確認できます。エントリーの例は次のとおりです。
